2.2.013/src/Catalogs/МК_ДокументыКЭДО/МК_ДокументыКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ДокументыКЭДО</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаДокумента</name>
    <comment>Код типа документа справочника в МояКоманда</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСсылка</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.МК_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученИзМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительФЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЭЦП</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьПодписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СотрудникиДокумента</name>
    <attributes>
      <name>СотрудникСсылка</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Enums/МК_СтатусыДокументов/МК_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыДокументов</name>
  <enumValues>
    <name>С1</name>
  </enumValues>
  <enumValues>
    <name>С2</name>
  </enumValues>
  <enumValues>
    <name>С3</name>
  </enumValues>
  <enumValues>
    <name>С4</name>
  </enumValues>
  <enumValues>
    <name>С5</name>
  </enumValues>
  <enumValues>
    <name>С6</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ЗаявленияСотрудников/МК_ЗаявленияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявленияСотрудников</name>
  <attributes>
    <name>МК_ВидЗаявления</name>
    <type>
      <types>CatalogRef.МК_НастройкиСвязиЗаявленийКЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПодписанияОчередногоУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодЗаявкиНаОтсутствие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставРоли</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписант</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ДокументыКЭДО/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыборТипа = ЛОЖЬ;   
	//Определяем тип по умолчанию
	Элементы.МЧД.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.МашиночитаемыеДоверенности");  
	
	мИмяФайла = СокрЛП(ЭтаФорма.Объект.ПутьДоФайлаДокумента); 
	мДлина = СтрДлина(мИмяФайла);            
	мИндекс = СтрНайти(мИмяФайла, "/", НаправлениеПоиска.СКонца); 
	мИмяФайла = Прав(мИмяФайла, мДлина - мИндекс);   
	Элементы.ПосмотретьФайлДокумента.Заголовок = мИмяФайла;	 	
	Элементы.СсылкаНаДокументМК.Заголовок = ЭтаФорма.СсылкаНаДокументМК;
	ПоказатьКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКнопки()   
	// Сначала опоставим для всех кнопок видимость Истина, а потом будем откулючать
	Элементы.Подписать.Видимость = Истина;
	Элементы.Отклонить.Видимость = Истина;
	Элементы.Удалить.Видимость = Истина;  
	Элементы.Напомнить.Видимость = Истина; 
	Элементы.Делегировать.Видимость = Истина;
	// Надо найти текущего подписанта
	мНомерУчастника = Неопределено;
	мТипПодписи = Неопределено;
	мНашел = Ложь;   	
	мТЗ = Объект.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мТипПодписи = мСтр.ТипПодписи; 
			мНашел = Истина;  		
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     	
	Если Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С4") Или        // Выполнен		 
		  Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С6") Тогда     // Недействителен    
		 Элементы.Удалить.Видимость = Ложь;
	КонецЕсли;       
	//Кнопка "Напомнить" доступна для документов в статусах “На подписании”, “Просрочен”,                                    
	Если Не (Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С2") Или            
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С3")) Тогда         
		Элементы.Напомнить.Видимость = Ложь;
	КонецЕсли;       
    // Кнопка "Делегировать" доступна для документов в статусах “Черновик”, “На подписании”, “Просрочен”, и еще не подписанных директором;
	// Последнее предлагается определять так: если текущий подписант имеет тип подписи УКЭП, значит то,что надо.
    Если Не (Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С1") Или            
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С2") Или
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С3")) Тогда    
		Элементы.Делегировать.Видимость = Ложь;			
	Иначе	
		мПослеТекущего = Ложь;
        мНашел = Ложь;
		мТЗ = Объект.Подписанты;
		Для Каждого мСтр Из мТЗ Цикл
			Если мСтр.ТекущийПодписант Или мПослеТекущего Тогда 
				мПослеТекущего = Истина;
				мНомерУчастника = мСтр.Номер;			
				Если мСтр.ТипПодписи = "УКЭП" Тогда
					мНашел = Истина; 
					Прервать;
				КонецЕсли;					
			КонецЕсли;	
		КонецЦикла;	   
		Если Не мНашел Тогда
			Элементы.Делегировать.Видимость = Ложь;			
		КонецЕсли;	
	КонецЕсли;   
	// Теперь "Подписать" и "Отклонить". Тут надо проверить совпадение текущего пользователя и ТекущегоПодписанта в документе
	мФЛ = ЭтаФорма.ВладелецФормы.Родитель.Пользователь;	
	Если Не (мФЛ = Объект.ТекущийПодписант) Тогда           
		Элементы.Подписать.Видимость = Ложь;			
		Элементы.Отклонить.Видимость = Ложь;
	ИначеЕсли НЕ (Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С2") Или
		   		  Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С3")) Тогда
		Элементы.Подписать.Видимость = Ложь;			
		Элементы.Отклонить.Видимость = Ложь;		
	ИначеЕсли НЕ (мТипПодписи = "УКЭП") Тогда 
		Элементы.Подписать.Видимость = Ложь;
		Элементы.Отклонить.Видимость = Ложь;
	КонецЕсли;	 
КонецПроцедуры	



&НаКлиенте
Процедура ПосмотретьФайлДокумента(Команда)
	мФайл = ЭтаФорма.Объект.ПутьДоФайлаДокумента;    
	мPDF = ПолучитьФайл(мФайл,1); 
	Если НЕ (мPDF = Неопределено) Тогда
		мPDF.Показать("Документ"); 
	КонецЕсли;  
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФайл(мФайл, мРежим) 
	//Возврат Справочники.МК_ДокументыКЭДО.СкачатьФайлНаСервере(мФайл); 
	мПуть = Справочники.МК_ДокументыКЭДО.ПолучитьИмяФайла(мФайл);
	Возврат Справочники.МК_ЗаявленияСотрудников.СкачатьФайлНаСервере(мПуть,мРежим);  
КонецФункции

&НаСервере
Функция ДелегироватьНаСервере1()  
	// Делегирование — получение списка пользователей
	// GET /api/1c-exchange/edms/documents/delegate/users-list
	мНашел = Ложь;   
	мРез = Новый Структура("Результат,ТекстОшибки,СписокДелегатов", Ложь);
	мТЗ = Объект.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мРез = Справочники.МК_ДокументыКЭДО.ПолучитьСписокДелегатов(мНомерУчастника);				
	КонецЕсли;	
	Возврат мРез; 	
КонецФункции

&НаКлиенте
Процедура Делегировать(Команда)  	
	мРез = ДелегироватьНаСервере1(); 
	Если мРез.Результат Тогда
		мСпис = мРез.Подписанты;  
		Если мСпис.Количество()>0 Тогда
			мПараметры = Новый Структура("СписокДелегатов,НомерУчастника",мСпис,мРез.НомерУчастника) ; 				
			Оп = Новый ОписаниеОповещения("МК_ВыполнитьПослеОкончания", ЭтотОбъект); 
			ОткрытьФорму("Справочник.МК_ДокументыКЭДО.Форма.ФормаВыбораПодписанта",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе	                                                            
			ПоказатьПредупреждение(,"Список подписантов пуст");
		КонецЕсли;	
	Иначе                       
		ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
	КонецЕсли;		
КонецПроцедуры    

&НаКлиенте
Процедура МК_ВыполнитьПослеОкончания(мПарам, мДопПарам)      Экспорт    
	мЗ = Объект.Ссылка;
	Если ЗначениеЗаполнено(мПарам) Тогда 		
		мРез = ДелегироватьНаСервере2(мПарам);	
		Если Не мРез.Результат Тогда  
			ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки); 
		Иначе	                                                                 
			ПоказатьПредупреждение(,"Делегирование выполнилось успешно"); 
		КонецЕсли;
		ОповеститьОбИзменении(мЗ);
	КонецЕсли;	
	ПоказатьКнопки();
	ЭтаФорма.ОбновитьОтображениеДанных(); 
КонецПроцедуры    

&НаСервере
Функция ДелегироватьНаСервере2(мПарам) 
	// Делегирование — отправка назначения
	// POST/api/1c-exchange/edms/documents/delegate	
	мЗ = Объект.Ссылка;
    мРез = Справочники.МК_ДокументыКЭДО.ОтправитьДелегата(мПарам);  
	мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
	Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);  	
	ЭтаФорма.Прочитать();
	Возврат мРез;
КонецФункции  

&НаСервере
Функция НапомнитьНаСервере()    
	мЗ = Объект.Ссылка;	
	мРез = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);
	мНашел = Ложь;   	
	мТЗ = мЗ.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мПараметры = Новый Структура("НомерУчастника",мНомерУчастника) ; 				
		мРез = Справочники.МК_ДокументыКЭДО.НапомнитьОПодписании(мПараметры);    
		Если мРез.Результат Тогда
			мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
			Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);
			ЭтаФорма.Прочитать();  
		КонецЕсли;	
	Иначе
		мРез.ТекстОшибки = "Некому напоминать";
	КонецЕсли;	
	Возврат мРез;  
КонецФункции

&НаКлиенте
Процедура Напомнить(Команда)  
	мЗ = Объект.Ссылка;	
	мРез = НапомнитьНаСервере();   
	Если мРез.Результат Тогда
		ПоказатьПредупреждение(,"Напоминание отправлено удачно");  	
	Иначе	
		ПоказатьПредупреждение(,мРез.ТекстОшибки);  	
	КонецЕсли;	
	ПоказатьКнопки();  
	ЭтаФорма.ОбновитьОтображениеДанных(); 
	ОповеститьОбИзменении(мЗ);
КонецПроцедуры

&НаСервере
Функция УдалитьНаСервере(мЗ)
	мРез = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);
	мДок = СокрЛП(мЗ.УникальныйИдентификатор());
	мРез = Справочники.МК_ДокументыКЭДО.УдалитьДокумент(мДок);
	мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
	Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);
	ЭтаФорма.Прочитать();
	Возврат мРез;
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)	
    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдаления", ЭтотОбъект);
    ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите удалить документ?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры       

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдаления(мРез, ДопПарам) Экспорт  
	Если мРез = КодВозвратаДиалога.Да Тогда
		мЗ = Объект.Ссылка;	
		//Для документов в статусах “Выполнен” и “Недействителен” нажатие возвращает сообщение об ошибке “Удаление документа в данном статусе невозможно”
		мРез = УдалитьНаСервере(мЗ);
		Если мРез.Результат Тогда
			ПоказатьПредупреждение(,"Удаление выполнено удачно");  	
		Иначе	
			ПоказатьПредупреждение(,мРез.ТекстОшибки);  	
		КонецЕсли;	
		ПоказатьКнопки();  
		ЭтаФорма.ОбновитьОтображениеДанных();  
		ОповеститьОбИзменении(мЗ);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПодписатьНаСервере()
	
КонецФункции



&НаКлиенте
Процедура Подписать(Команда) 
	// Сначала нужно получить файл. Иначе нечего будет подписывать. 
	мПарамПодписи = Неопределено;
	мФайл = ЭтаФорма.Объект.ПутьДоФайлаДокумента;    
	мДД = ПолучитьФайл(мФайл,2);  	// Если 2, то возвращаются двоичные данные
	АдрPDF = ПоместитьВоВременноеХранилище(мДД, ЭтаФорма.УникальныйИдентификатор);
	Если НЕ (мДД = Неопределено) Тогда  
		мПараметры = Новый Структура("ТабличныйДокумент,IDдокумента,НовыйУИД,ПараметрыПодписи,Организация",  
									                                        ,,,мПарамПодписи,Объект.ОрганизацияСсылка) ; 				
		Оп = Новый ОписаниеОповещения("МК_ВыполнитьПослеПолученияПодписи", ЭтотОбъект,АдрPDF); 
		ОткрытьФорму("Обработка.МК_ОтправкаДокумента.Форма.МК_ПодписаниеЭЦП",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//ПодписатьНаСервере(мPDF);
	Иначе
		ПоказатьПредупреждение(,"Не удалось получить файл документа");	
	КонецЕсли;  	
КонецПроцедуры  

&НаКлиенте                                            
Функция МК_ВыполнитьПослеПолученияПодписи(мПарам, мДопПарам) Экспорт	  // Сюда попадаем после получения реквизитов подписи.
	мСерверноеПодпиcание = ЭтаФорма.СоздаватьЭЦПНаСервере;
	Если мПарам = Неопределено Тогда                                                        
		мРезультат = Новый Массив(1); 
		мРезультат[0] = 6;
	Иначе		
		// Подписание документа.     
		мПарамПодписи = мПарам.ПараметрыПодписи;  
		мАдрPDF = мДопПарам;     	
		Если мСерверноеПодпиcание Тогда                                    
			//Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда       
			//	мРезультат = СоздатьPDFы(мРежим, мПарамПодписи);
			//Иначе	                 	
			//	мНовыйУИД = мПарам.НовыйУИД;    
			//	мРезультат = СоздатьPDFНаСервере(мТабДок,мИдент,мРежим,мНовыйУИД,мПарамПодписи,Неопределено);	 
			//КонецЕсли;				
		Иначе          			
			мРез = ПодписатьДокументНаКлиенте(мАдрPDF,мПарамПодписи,мПарам.МенеджерКрипты);   
			// Структура мРез: "Успешно,Подпись,ТекстОшибки"
			Если мРез.Успешно = Ложь Тогда   // Это значит, что подписание обломалось совсем. 
				ПоказатьПредупреждение(, мРез.ТекстОшибки);
			Иначе				 
				мРез = ОтправитьПодпись(мПарамПодписи, мРез.Подпись);   
				Если мРез.Результат Тогда
					ПоказатьПредупреждение(,"Подписание выполнено успешно");  
					Элементы.Отклонить.Видимость = Ложь;
					Элементы.Подписать.Видимость = Ложь;
				Иначе	
					ПоказатьПредупреждение(,мРез.ТекстОшибки);  	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	  	
	ПоказатьКнопки();  
	ЭтаФорма.ОбновитьОтображениеДанных();  	 
	ОповеститьОбИзменении(Объект.Ссылка);
КонецФункции	

&НаКлиенте
Функция ПодписатьДокументНаКлиенте(мАдрPDF, мПарамПодписи, мМК)  		
	мРез = Новый Структура("Успешно,Подпись,ТекстОшибки",Истина);
	
	Если ТипЗнч(мМК) = Тип("Строка") Тогда
		мРез.Успешно = Ложь;
		мРез.ТекстОшибки = мМк;   
		Возврат мРез
	КонецЕсли;

	мДанныеДокумента = ПолучитьИзВременногоХранилища(мАдрPDF);
		
	Если ЗначениеЗаполнено(мПарамПодписи.Пароль) Тогда                    
		мМК.ПарольДоступаКЗакрытомуКлючу = мПарамПодписи.Пароль; // строка		
	КонецЕсли;
	
	ПотокВПамяти = Новый ПотокВПамяти;     	
	мДСерт = ПолучитьДанныеСертификата(мПарамПодписи.Сертификат);	
	мСертификат = Новый СертификатКриптографии(мДСерт);	
	
	Попытка
		мМК.Подписать(мДанныеДокумента,ПотокВПамяти,мСертификат);
		мРез.Подпись = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные(); 		
	Исключение
		мРез.Успешно = Ложь;
		мРез.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;  
	Возврат мРез;  
КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьДанныеСертификата(мСерт)
	мДСерт = мСерт.СертификатЭЦП.ДанныеСертификата.Получить();
	Возврат мДСерт;
КонецФункции	

&НаСервере
Функция ОтправитьПодпись(мПарамПодписи,мПодпись); 
	мЗ = Объект.Ссылка;	
	мРез = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);
	мНашел = Ложь;   	
	мТЗ = мЗ.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мПараметры = Новый Структура("НомерУчастника, ПарамПодписи, Подпись",мНомерУчастника, мПарамПодписи, мПодпись) ; 				
		мРез = Справочники.МК_ДокументыКЭДО.ОтправитьПодпись(мПараметры); 
		мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
		Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);
		ЭтаФорма.Прочитать();  
	КонецЕсли;	
	Возврат мРез; 	
КонецФункции	

&НаСервере
Функция ОтклонитьНаСервере(мПричина)  
	мЗ = Объект.Ссылка;	
	мРез = Новый Структура("Результат,ТекстОшибки,Подписанты,Статус", Ложь);
	мНашел = Ложь;   	
	мТЗ = мЗ.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мПараметры = Новый Структура("НомерУчастника, Причина",мНомерУчастника, мПричина) ; 				
		мРез = Справочники.МК_ДокументыКЭДО.ОтклонитьПодписание(мПараметры); 
		мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
		Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);
		ЭтаФорма.Прочитать();  
	КонецЕсли;	
	Возврат мРез;  
КонецФункции

&НаКлиенте
Процедура Отклонить(Команда)  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПричинаОтклонения", ЭтотОбъект);
	ПоказатьВводСтроки(ОписаниеОповещения, "", "Укажите причину", , Истина); // Истина - многострочный   
КонецПроцедуры	

&НаКлиенте
Процедура ПричинаОтклонения(мПричина, ДополнительныеПараметры) Экспорт
	Если мПричина = Неопределено Тогда     
		ПоказатьПредупреждение(,"Причину нужно указать обязательно");  	
	Иначе	
    	мЗ = Объект.Ссылка;	  		
		мРез = ОтклонитьНаСервере(мПричина);   
		Если мРез.Результат Тогда
			ПоказатьПредупреждение(,"Отклонение выполнено успешно");  	
		Иначе	
			ПоказатьПредупреждение(,мРез.ТекстОшибки);  	
		КонецЕсли;		                
		ПоказатьКнопки();  
		ЭтаФорма.ОбновитьОтображениеДанных();  	 		
		ОповеститьОбИзменении(мЗ);               	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаДокументМК(Команда)
	ЗапуститьПриложение(ЭтаФорма.СсылкаНаДокументМК);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мАдрес = ВычислитьАдресСсылки();
	ЭтаФорма.СсылкаНаДокументМК = мАдрес;  
	ЭтаФорма.СоздаватьЭЦПНаСервере = Константы.СоздаватьЭлектронныеПодписиНаСервере.Получить(); 
КонецПроцедуры

&НаСервере
Функция ВычислитьАдресСсылки()
	мНаим = Константы.МК_Сервер.Получить();
	Если Прав(мНаим, 1) = "/" Тогда
		мНаим = Лев(мНаим, СтрДлина(мНаим)-1);
	КонецЕсли;	
	мНаим = мНаим + "/edms/documents/"+Формат(Объект.МК_КодДокумента, "ЧГ=0");
	Возврат мНаим;
КонецФункции
